# Taps
tap "homebrew/core"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "buo/cask-upgrade"
tap "cloudfoundry/tap"
tap "go-delve/delve"
tap "minio/stable"

# Languages
brew "go"
brew "node"
    brew "icu4c"
brew "python"
brew "python3"
    brew "sqlite"
    brew "gdbm"
brew "ruby"

# Tools
brew "cloudfoundry/tap/cf-cli"
brew "cmake"
brew "dep"
brew "fzf"
brew "git"
brew "go-delve/delve/delve"
brew "htop"
brew "jq"
    brew "oniguruma"
brew "kubectl"
brew "mas"
brew "mc"
    brew "pkg-config"
    brew "libffi"
    brew "glib"
    brew "libpng"
    brew "s-lang"
    brew "libssh2"
brew "mongodb"
brew "neovim"
    brew "gettext"
    brew "jemalloc"
    brew "libtermkey"
    brew "libuv"
    brew "libvterm"
    brew "msgpack"
    brew "unibilium"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "the_silver_searcher"
brew "tig"
brew "tmate"
brew "tmux"
    brew "openssl"
brew "wget"
    brew "openssl@1.1"
brew "zsh"
    brew "pcre"

# Desktop Applications
cask "alfred"
cask "appcleaner"
cask "docker"
cask "dropbox"
cask "google-chrome"
cask "graphiql"
cask "imageoptim"
cask "iterm2"
cask "microsoft-office"
cask "minikube"
cask "mongodb-compass"
cask "postman"
cask "rambox"
cask "skype-for-business"
cask "spotify"
cask "sqlectron"
cask "virtualbox"

mas "1Password", id: 443987910
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id:824183456
mas "BetterSnapTool", id: 417375580
mas "Caffeine", id: 411246225
mas "PopClip", id: 445189367
mas "The Unarchiver", id: 425424353
