# extra.Brewfile can be used for packages you don't want to commit.

# Taps
tap "buo/cask-upgrade"
tap "golangci/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "sonatype-nexus-community/homebrew-nancy-tap"

brew "awscli"
brew "awslogs"
brew "diff-so-fancy"
brew "driftctl"
brew "eslint"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "golangci/tap/golangci-lint"
brew "gopass"
brew "gopass-jsonapi"
brew "gron"
brew "hadolint"
brew "htop"
brew "hugo"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "lolcat"
brew "make"
brew "mas"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "podman"
brew "prettier"
brew "protobuf"
brew "pwgen"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "shellcheck"
brew "sonatype-nexus-community/homebrew-nancy-tap/nancy"
brew "speedtest-cli"
brew "spotifyd"
brew "spotify-tui"
brew "termshark"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "tmate"
brew "tmux"
brew "tree"
brew "typescript"
brew "vifm"
brew "watch"
brew "watchman"
brew "wget"
brew "yq"
brew "zsh"
cask "alacritty"
cask "appcleaner"
cask "dropbox"
cask "firefox"
cask "font-fira-mono"
cask "gimp"
cask "imageoptim"
cask "inkscape"
cask "signal"
cask "virtualbox"
mas "BetterSnapTool", id: 417375580
