# extra.Brewfile can be used for packages you don't want to commit.

# Taps
tap "buo/cask-upgrade"
tap "cloudfoundry/tap"
tap "github/gh"
tap "golangci/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "nickolasburr/pfa"
tap "sonatype-nexus-community/homebrew-nancy-tap"

brew "alacritty"
brew "appcleaner"
brew "awscli"
brew "awslogs"
brew "diff-so-fancy"
brew "driftctl"
brew "dropbox"
brew "eslint"
brew "fd"
brew "firefox"
brew "font-fira-mono"
brew "fzf"
brew "gimp"
brew "git"
brew "github/gh/gh"
brew "gnupg"
brew "go"
brew "golangci/tap/golangci-lint"
brew "gopass"
brew "gron"
brew "hadolint"
brew "htop"
brew "hugo"
brew "imageoptim"
brew "inkscape"
brew "jq"
brew "kubectl"
brew "kubectx"
brew "lolcat"
brew "make"
brew "mas"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "node"
brew "podman"
brew "prettier"
brew "protobuf"
brew "pwgen"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "signal"
brew "sonatype-nexus-community/homebrew-nancy-tap/nancy"
brew "speedtest-cli"
brew "spotifyd"
brew "spotify-tui"
brew "termshark"
brew "terraform"
brew "terraform-ls"
brew "tflint"
brew "tmate"
brew "tmux"
brew "tree"
brew "typescript"
brew "vifm"
brew "virtualbox"
brew "watch"
brew "watchman"
brew "wget"
brew "yq"
brew "zsh"
mas "BetterSnapTool", id: 417375580
